# StartSymbolType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StartSymbolType Property
ParameterTypeId Class See Also
---
"Start Symbol Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StartSymbolType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StartSymbolType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StartSymbolType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace